================================================================================
integer
================================================================================
.PS
foo = 42
.PE

--------------------------------------------------------------------------------
(picture
  (element
    (command_line))
  (element
    (assignment
      (variable)
      (any_expr
        (expr
          (number)))))
  (element
    (command_line)))

================================================================================
float
================================================================================
.PS
foo = 42.1
.PE

--------------------------------------------------------------------------------
(picture
  (element
    (command_line))
  (element
    (assignment
      (variable)
      (any_expr
        (expr
          (number)))))
  (element
    (command_line)))

================================================================================
dimension
================================================================================
.PS
foo = 42.1i
.PE

--------------------------------------------------------------------------------
(picture
  (element
    (command_line))
  (element
    (assignment
      (variable)
      (any_expr
        (expr
          (number)))))
  (element
    (command_line)))

================================================================================
non-local
================================================================================
.PS
foo := 42
.PE

--------------------------------------------------------------------------------
(picture
  (element
    (command_line))
  (element
    (assignment
      (variable)
      (any_expr
        (expr
          (number)))))
  (element
    (command_line)))

================================================================================
built-in
================================================================================
.PS
scale = 42
.PE

--------------------------------------------------------------------------------
(picture
  (element
    (command_line))
  (element
    (assignment
      (variable)
      (any_expr
        (expr
          (number)))))
  (element
    (command_line)))
