================================================================================
block with one primitive
================================================================================
.PS
[ box ]
.PE

--------------------------------------------------------------------------------
(picture
  (element
    (block
      (element
        (primitive)))))

================================================================================
block with one primitive and newline
================================================================================
.PS
[ box
]
.PE

--------------------------------------------------------------------------------
(picture
  (element
    (block
      (element
        (primitive)))))

================================================================================
block with one primitive and two newlines
================================================================================
.PS
[
box
]
.PE

--------------------------------------------------------------------------------
(picture
  (element
    (block
      (element
        (primitive)))))

================================================================================
block with two primitives and two newlines
================================================================================
.PS
[
box; arrow
]
.PE

--------------------------------------------------------------------------------
(picture
  (element
    (block
      (element
        (primitive))
      (element
        (primitive)))))

================================================================================
block with two primitive and semicolon + two newlines
================================================================================
.PS
[
box; arrow;
]
.PE

--------------------------------------------------------------------------------
(picture
  (element
    (block
      (element
        (primitive))
      (element
        (primitive)))))

================================================================================
block with two primitives and semicolon + newline
================================================================================
.PS
[ box; arrow;
]
.PE

--------------------------------------------------------------------------------
(picture
  (element
    (block
      (element
        (primitive))
      (element
        (primitive)))))

================================================================================
block with two primitives and semicolon
================================================================================
.PS
[ box; arrow; ]
.PE

--------------------------------------------------------------------------------
(picture
  (element
    (block
      (element
        (primitive))
      (element
        (primitive)))))
